# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке,
# причём кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних.
# Всего на грядке растёт N кустов. Эти кусты обладают разной урожайностью,
# поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом,
# собирает ягоды с этого куста и с двух соседних с ним.Напишите программу для нахождения максимального числа ягод,
# которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.


N = int(input("Введите количество кустов: "))
max = 0
lst = []
if N > 2:
    for i in range(N):
        a = int(input("Введите количество ягод: "))
        lst.append(a)
    print(lst)
    index = 0
    for j in range(len(lst)):
        sum = lst[index] + lst[index + 1] + lst[index + 2]
        if sum > max:
            max = sum
        lst.insert(0, lst.pop())
    print(f"Максимальное количество ягод -- > {max}")
else:
    print("Введите число больше 2")
