# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону
# (т.е. не меньше заданного минимума и не больше заданного максимума)

import random

N = int(input("Введите количество элементов списка: "))
a = int(input("Введите нижнее значение диапазона: "))
b = int(input("Введите верхнее значение диапазона: "))
value_range = []
lst = []
for i in range(N):
    c = int(input("Введите число: "))
    lst.append(c)
    if c in range(a, b + 1):
        value_range.append(i)


print(lst)

print(value_range)
