# Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел.
# Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.

num_1 = int(input("Введите первое число: "))
num_2 = int(input("Введите второе число: "))


def summ(a, b):
    if b == 0:
        return a
    return 1 + summ(a, b - 1)


res = summ(num_1, num_2)
print(f"Результат равен {res}")
