
"""
Петя, Катя и Сережа делают из бумаги журавликов.
Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок,
если известно , что Петя и Сережа сделали одинаковое количество журавликов,
а Катя сделала в 2 раза больше журавликов, чем Петя и Сережа вместе?

"""

n = int(input("Введите количество журавликов: "))

if n % 6 == 0:  # Чтобы получить точный результат число должно делиться на 3 без остатка
    a = n // 6   # Если Катя сделала в два раза больше журавликов, чем мальчики вместе, то она сделала 2/3 журавликов
    b = 4 * a
    print(f"Петя и Сережа сделали по {a}, Катя сделала {b} журавликов")
else:
    print("Введите число, которое делится на 3")
