# Петя загадал два числа X и Y.
# Назвать эти числа, зная их сумму S и произведение P.

S = int(input("Введите сумму s: "))
P = int(input("Введите произведение p: "))

# y = S - x
# x * (S - x) == P
# -x * x + S * x - P == 0

D = S * S - 4 * -1 * -P
print(f"Дискриминант {D}")
if D > 0:
    x = int((- S - pow(D, 0.5)) / 2 * -1)
    y = int((- S + pow(D, 0.5)) / 2 * -1)
    print(f"Первое число {x}, второе число {y}")
if D == 0:
    x = int(- S / 2 * -1)
    y = x
    print(f"Первое число {x}, второе число {y}")


